Demo_Kabeli/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <basedOn>Document.ЗаданияНаМонтаж</basedOn>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВКнаКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
</mdclass:Document>

Demo_Kabeli/src/InformationRegisters/ДанныеПоЗаявкамНаЗакупку/ДанныеПоЗаявкамНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоЗаявкамНаЗакупку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </resources>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходногоКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Kabeli/src/Documents/ЗаявкиНаЗакупки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДанныеПоЗаявкамНаЗакупку.Записывать = Истина;
	
	НоваяЗапись                               = Движения.ДанныеПоЗаявкамНаЗакупку.Добавить();
	НоваяЗапись.Период                        = Дата; 
	НоваяЗапись.ЖурналУчетаКабельнойПродукции = ЖурналУчетаКабельнойПродукции;  
	НоваяЗапись.Подрядчик                     = Подрядчик;
	НоваяЗапись.Статус                        = Статус;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоОтменаЗаявки() И СтатусыПроверкаСервер.ЖурналКабельнойЛинииСмонтирован(ЖурналУчетаКабельнойПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Монтаж выполнен, нельзя отменить документ!",,,, Отказ);	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ЭтоОтменаЗаявки()
	
	ТекущийСтатусВыполнен = (Ссылка.Статус = Перечисления.СтатусыЗаявок.Выполнена);
	СменаСтатуса          = (Статус <> Ссылка.Статус);
	
	Возврат ТекущийСтатусВыполнен И СменаСтатуса;
	
КонецФункции
